package io.ohjongsung.algorithm.ctci.phase02;

/**
 * Project : algorithm
 * Developer : ohjongsung
 * Date : 2017-08-26
 * Description : 구현한 연결 리스트로 문제를 풀었다.
 */
public class Problems {
    /**
     * 01. 비정렬(unsorted)연결 리스트에서 중복 문자를 제거하는 코드를 작성하라.
     *     연관 문제 : 임시 버퍼가 허용되지 않는 상황에서 이 문제를 어떻게 해결할 수 있겠는가?
     * 02. 단방향 연결 리스트에서, 뒤에서 K번째 원소를 찾는 알고리즘을 구현하라.
     * 03. 단방향 연결 리스트의 중앙에 있는 노드 하나를 삭제하는 알고리즘을 구현하라.  삭제할 노드에 대한 접근만 가능하다는 것에
     *     유의 하라.
     * 04. x값을 갖는 노드를 기준으로 연결 리스트를 나누는 코드를 작성하라. x보다 작은 값을 갖는 노드가 x와 같거나 더 큰값을 갖는
     *     노드들보다 앞쪽에 오도록 하면 된다.
     * 05. 연결 리스트로 표현된 두 개의 수가 있다고 하자. 리스트의 각 노드는 해당 수의 각 자릿수를 표현한다. 이때 자릿수들은 역순으로
     *     배열되는데, 1의 자릿수가 리스트의 맨 앞에 오도록 배열된다는 뜻이다. 이 두 수를 더하여 그 합을 연결 리스트로 반환하는 함수를
     *     작성하라. 예) 입력: (7->1->6) + (5->9->2) 즉, 617 + 295 출력: 2->1->9 즉, 912
     *     연관문제
     *     각 자릿수가 정상적으로 배열된다고 가정하고 구현해 보자. 예) 입력: (7->1->6) + (5->9->2) 즉, 617 + 295
     * 06. 순환 연결 리스트가 주어졌을 때, 순환되는 부분의 첫 노드를 반환하는 알고리즘을 작성하라.
     *     정의) 순환 연결 리스트 : 노드의 next 포인터가 앞선 노드들 가운데 어느 하나를 가리키도록 설정되어 있는 망가진 연결 리스트
     *     예) 입력 : A->B->C->D->E->C (E의 next 노드가 D 앞에 있는 C로 설정되어 있다) 출력 : C
     * 07. 주어진 연결 리스트가 회문(palindrome)인지 검사하는 함수를 작성하라.
     */
}
